cylinderScouring/case1_downwide/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          900;
        startFace       235350;
    }
    outlet
    {
        type            patch;
        nFaces          900;
        startFace       236250;
    }
    upperwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5400;
        startFace       237150;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5400;
        startFace       242550;
    }
    rightwall
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1350;
        startFace       247950;
    }
    leftwall
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1350;
        startFace       249300;
    }
)

// ************************************************************************* //
